from PIL import ImageFont


FONTSIZE = 20
FONT = ImageFont.truetype("/usr/share/fonts/noto/NotoSerif-Bold.ttf", FONTSIZE)

WIDTH, HEIGHT = 2350, 1600
BACKGROUND_COLOR = (255, 255, 255, 255)
COLOR = (0, 0, 0, 255)
SEMI_TRANSPARENT = (0, 0, 0, 100)
SEMI_TRANSPARENT_COLORED = (0, 127, 255, 50)

BP_EPOCH = 1950
PRESENT = 2025
BIG_BANG = (13.787 * 10**9 # Before Present
            - BP_EPOCH + PRESENT) # -> Current day

YEAR_TACKS = [
    "10 млрд лет назад",
    "6 млрд лет назад", "4 млрд лет назад", "2.5 млрд лет назад", "1.5 млрд лет назад", "1 млрд лет назад",
    "600 млн лет назад", "400 млн лет назад", "250 млн лет назад", "150 млн лет назад", "100 млн лет назад",
    "60 млн лет назад", "40 млн лет назад", "25 млн лет назад", "15 млн лет назад", "10 млн лет назад",
    "6 млн лет назад", "4 млн лет назад", "2.5 млн лет назад", "1.5 млн лет назад", "1 млн лет назад",
    "600 тыс. лет назад", "400 тыс. лет назад", "250 тыс. лет назад", "150 тыс. лет назад", "100 тыс. лет назад",
    "60 тыс. лет назад", "40 тыс. лет назад", "25 тыс. лет назад", "15 тыс. лет назад", "10 тыс. лет назад",
    "3500 до н.э.", "1500 до н.э.", "1 н.э.", "700 н.э.", "1200 н.э.", "1500 н.э.", "1700 н.э.", "1820 н.э.", "1900 н.э.", "1940 н.э.", "1970 н.э.", "1990 н.э.", "2005 н.э.", "2015 н.э.", "2020 н.э.", "2022-02 н.э.", "2023-06 н.э."

]

# YEAR_TACKS = [
#     "10 млрд лет назад", "5 млрд лет назад", "2 млрд лет назад", "1 млрд лет назад",
#     "500 млн лет назад", "200 млн лет назад", "100 млн лет назад", "50 млн лет назад", "20 млн лет назад", "10 млн лет назад", "5 млн лет назад", "2 млн лет назад", "1 млн лет назад",
#     "500 тыс. лет назад", "200 тыс. лет назад", "100 тыс. лет назад", "50 тыс. лет назад", "20 тыс. лет назад", "10 тыс. лет назад",
#     "3000 до н.э.", "1000 до н.э.", "200 н.э.", "1000 н.э.", "1500 н.э.", "1800 н.э.",
#     "1900 н.э.", "1950 н.э.", "1980 н.э.", "2000 н.э.", "2010 н.э.", "2016 н.э.", "2020 н.э.", "2022 н.э.",
# ]
