from PIL import ImageFont


FONTSIZE = 20
FONT = ImageFont.truetype("/usr/share/fonts/noto/NotoSerif-Bold.ttf", FONTSIZE)

WIDTH, HEIGHT = 2230, 1600
BACKGROUND_COLOR = (255, 255, 255, 255)
COLOR = (0, 0, 0, 255)
SEMI_TRANSPARENT = (0, 0, 0, 100)
SEMI_TRANSPARENT_COLORED = (0, 127, 255, 50)

BP_EPOCH = 1950
PRESENT = 2025
BIG_BANG = (13.787 * 10**9 # Before Present
            - BP_EPOCH + PRESENT) # -> Current day

YEAR_TACKS = [
    "10 млрд лет",
    "6 млрд лет", "4 млрд лет", "2.5 млрд лет", "1.5 млрд лет", "1 млрд лет",
    "600 млн лет", "400 млн лет", "250 млн лет", "150 млн лет", "100 млн лет",
    "60 млн лет", "40 млн лет", "25 млн лет", "15 млн лет", "10 млн лет",
    "6 млн лет", "4 млн лет", "2.5 млн лет", "1.5 млн лет", "1 млн лет",
    "600 тыс. лет", "400 тыс. лет", "250 тыс. лет", "150 тыс. лет", "100 тыс. лет",
    "60 тыс. лет", "40 тыс. лет", "25 тыс. лет", "15 тыс. лет", "10 тыс. лет",
    "3500 до н.э.", "1500 до н.э.", "1 н.э.", "700 н.э.", "1200 н.э.", "1500 н.э.", "1700 н.э.", "1820 н.э.", "1900 н.э.", "1940 н.э.", "1970 н.э.", "1990 н.э.", "2005 н.э.", "2015 н.э.", "2020 н.э.", "2022-02 н.э.", "2023-06 н.э."

]

# YEAR_TACKS = [
#     "10 млрд лет", "5 млрд лет", "2 млрд лет", "1 млрд лет",
#     "500 млн лет", "200 млн лет", "100 млн лет", "50 млн лет", "20 млн лет", "10 млн лет", "5 млн лет", "2 млн лет", "1 млн лет",
#     "500 тыс. лет", "200 тыс. лет", "100 тыс. лет", "50 тыс. лет", "20 тыс. лет", "10 тыс. лет",
#     "3000 до н.э.", "1000 до н.э.", "200 н.э.", "1000 н.э.", "1500 н.э.", "1800 н.э.",
#     "1900 н.э.", "1950 н.э.", "1980 н.э.", "2000 н.э.", "2010 н.э.", "2016 н.э.", "2020 н.э.", "2022 н.э.",
# ]
